[
    { "id":"1", "date": "August 5, 2023","title":"Alan Adı Nedir ?" ,"content": "Bir domain adı, alfasayısal bir IP adresine eşlenen bir metin dizisidir ve istemci yazılımından bir web sitesine erişmek için kullanılır. Basit bir ifadeyle, bir domain adı, bir kullanıcının belirli bir web sitesine ulaşmak için tarayıcı penceresine yazdığı metindir. Örneğin, Google'ın domain adı 'google.com' dur. Bir web sitesinin gerçek adresi karmaşık bir sayısal IP adresidir (örneğin, 192.0.2.2), ancak DNS sayesinde kullanıcılar insan dostu domain adlarını girebilir ve aradıkları web sitelerine yönlendirilebilirler. Bu süreç, bir dns araması olarak bilinir."},
    { "id":"2","date": "August 6, 2023","title":"Hosting nedir?" , "content": "Web barındırma, web sitenizin içeriğini internet üzerinde erişilebilir hale getiren bir çevrimiçi hizmettir. Bir barındırma planı satın aldığınızda, tüm web sitesi dosyalarını ve verilerini depolamak için bir fiziksel sunucuda alan kiralıyorsunuz.Web barındırma sağlayıcıları, web sitenizin etkili ve güvenli bir şekilde çalışması için gereken barındırma teknolojisini ve kaynakları sağlarlar. Sunucunun çalışmasını sağlamak, barındırma güvenlik önlemlerini uygulamak ve metinler, fotoğraflar ve diğer dosyalar gibi verilerin ziyaretçilerin tarayıcılarına başarılı bir şekilde aktarılmasını sağlamak onların sorumluluğundadır." },
    { "id":"3","date": "August 7, 2023","title":"DNS nedir ve nasıl çalışır?" , "content": "Alan Adı Sistemi (DNS), İnternet'in telefon rehberidir. İnsanlar bilgiye çevrimiçi olarak nytimes.com veya espn.com gibi alan adları aracılığıyla erişir. Web tarayıcıları İnternet Protokolü (IP) adresleri aracılığıyla etkileşime girer. DNS, alan adlarını IP adreslerine çevirir , böylece tarayıcılar İnternet kaynaklarını yükleyebilir.İnternete bağlı her cihazın, diğer makinelerin cihazı bulmak için kullandığı benzersiz bir IP adresi vardır. DNS sunucuları, insanların 192.168.1.1 (IPv4'te) gibi IP adreslerini veya 2400:cb00:2048:1::c629:d7a2 (IPv6'da) gibi daha karmaşık yeni alfasayısal IP adreslerini ezberleme ihtiyacını ortadan kaldırır." },
    { "id":"4","date": "August 8, 2023","title":"Http nedir?" , "content": "Adını çokça duyduğumuz bir kavram olan “http”, bilginin sunucudan kullanıcıya nasıl ve ne şekilde aktarılacağını gösteren protokoldür. Açılımı “Hyper Text Transfer Protocol” olan bu kavram dilimizde “Üstün Metin Transfer Protokolü” olarak biliniyor. İnternet kullanıcıları bunu aktif olarak kullanmasa da otomatik olarak arama çubuğu bu protokolü koyar. Aslında en basit haliyle söylersek web sayfalarının görüntülenmesini sağlayan protokoldür. HTTP, kullanıcının bilgisayarı ve sunucu(server) arasındaki veri alışverişinin kurallarını belirler. Bu protokolü kullanmak için tarayıcı kullanılır. Google Chrome, Mozilla Firefox, Internet Explorer bu web tarayıcılarından bazılarıdır. Bu tarayıcılar yardımı ile herhangi bir internet sitesine girmek için adres çubuğuna sitenin adresini yazdığınız vakit HTTP ile sunucuya bir istek gönderilir ve sunucu bu isteğe cevap verdiği vakit internet sitesinin verileri size gelir. Yani internet sitesine girmiş olursunuz." },
    { "id":"5","date": "August 9, 2023","title":"Sürüm kontrol sistemleri nelerdir?" , "content": "Kaynak kontrolü olarak da bilinen sürüm kontrolü, yazılım kodundaki değişiklikleri izleme ve yönetme uygulamasıdır. Sürüm kontrol sistemleri, yazılım ekiplerinin zaman içinde kaynak kodunda yapılan değişiklikleri yönetmesine yardımcı olan yazılım araçlarıdır. Geliştirme ortamları hızlandıkça sürüm kontrol sistemleri yazılım ekiplerinin daha hızlı ve daha akıllı çalışmasına yardımcı olur. Geliştirme süresini kısaltmalarına ve başarılı dağıtımları artırmalarına yardımcı olduklarından DevOps ekipleri için özellikle faydalıdırlar.Sürüm kontrol yazılımı, kodda yapılan her değişikliği özel bir veri tabanında tutar. Bir hata yapılırsa geliştiriciler, tüm ekip üyelerinin aksamasını en aza indirirken hatanın düzeltilmesine yardımcı olmak için zamanı geri çevirebilir ve kodun önceki sürümlerini karşılaştırabilir." },
    { "id":"6","date": "August 10, 2023","title":"HTTPS nedir?" , "content": "Hypertext Transfer Protocol Secure (HTTPS), bir web tarayıcısı ile bir web sitesi arasında veri iletimi için kullanılan temel protokol olan HTTP'nin güvenli versiyonudur. HTTPS, veri iletiminin güvenliğini artırmak amacıyla şifrelenmiştir. Bu özellikle kullanıcıların banka hesaplarına, e-posta hizmetlerine veya sağlık sigortası sağlayıcılarına giriş yaparak hassas veri iletimi yaptıklarında önemlidir.Herhangi bir web sitesi, özellikle giriş kimlik bilgileri gerektirenler HTTPS kullanmalıdır. Google Chrome gibi modern web tarayıcılarında, HTTPS kullanmayan web siteleri farklı olarak işaretlenir. Güvenli olduğunu belirtmek için URL çubuğunda bir kilit simgesi arayın. Web tarayıcıları HTTPS'i ciddiye alır; Google Chrome ve diğer tarayıcılar tüm HTTPS kullanmayan web sitelerini güvenli olmayan olarak işaretler." }
  ]
  